In [1]:
import pandas as pd
import numpy as np
import sqlite3

In [2]:
import sys
sys.executable

'C:\\Users\\lalnasi.t\\AppData\\Local\\miniconda3\\envs\\hr-dashboard\\python.exe'


Load the data

In [3]:
df = pd.read_csv("data/WA_Fn-UseC_-HR-Employee-Attrition.csv")
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [ ]:
Size of the data

In [5]:
df.shape

(1470, 35)

Dataset info

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Age                       1470 non-null   int64
 1   Attrition                 1470 non-null   object
 2   BusinessTravel            1470 non-null   object
 3   DailyRate                 1470 non-null   int64
 4   Department                1470 non-null   object
 5   DistanceFromHome          1470 non-null   int64
 6   Education                 1470 non-null   int64
 7   EducationField            1470 non-null   object
 8   EmployeeCount             1470 non-null   int64
 9   EmployeeNumber            1470 non-null   int64
 10  EnvironmentSatisfaction   1470 non-null   int64
 11  Gender                    1470 non-null   object
 12  HourlyRate                1470 non-null   int64
 13  JobInvolvement            1470 non-null   int64
 14  JobLevel                  1470 non-null   int64
 15  JobRole                   1470 non-null   object
 16  JobSatisfaction           1470 non-null   int64
 17  MaritalStatus             1470 non-null   object
 18  MonthlyIncome             1470 non-null   int64
 19  MonthlyRate               1470 non-null   int64
 20  NumCompaniesWorked        1470 non-null   int64
 21  Over18                    1470 non-null   object
 22  OverTime                  1470 non-null   object
 23  PercentSalaryHike         1470 non-null   int64
 24  PerformanceRating         1470 non-null   int64
 25  RelationshipSatisfaction  1470 non-null   int64
 26  StandardHours             1470 non-null   int64
 27  StockOptionLevel          1470 non-null   int64
 28  TotalWorkingYears         1470 non-null   int64
 29  TrainingTimesLastYear     1470 non-null   int64
 30  WorkLifeBalance           1470 non-null   int64
 31  YearsAtCompany            1470 non-null   int64
 32  YearsInCurrentRole        1470 non-null   int64
 33  YearsSinceLastPromotion   1470 non-null   int64
 34  YearsWithCurrManager      1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB

In [12]:
df.describe()

,Age,DailyRate,DistanceFromHome,Education,EmployeeCount,EmployeeNumber,EnvironmentSatisfaction,HourlyRate,JobInvolvement,JobLevel,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
count,1470.000000,1470.000000,1470.000000,1470.000000,1470.0,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,...,1470.000000,1470.0,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000
mean,36.923810,802.485714,9.192517,2.912925,1.0,1024.865306,2.721769,65.891156,2.729932,2.063946,...,2.712245,80.0,0.793878,11.279592,2.799320,2.761224,7.008163,4.229252,2.187755,4.123129
std,9.135373,403.509100,8.106864,1.024165,0.0,602.024335,1.093082,20.329428,0.711561,1.106940,...,1.081209,0.0,0.852077,7.780782,1.289271,0.706476,6.126525,3.623137,3.222430,3.568136
min,18.000000,102.000000,1.000000,1.000000,1.0,1.000000,1.000000,30.000000,1.000000,1.000000,...,1.000000,80.0,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000
25%,30.000000,465.000000,2.000000,2.000000,1.0,491.250000,2.000000,48.000000,2.000000,1.000000,...,2.000000,80.0,0.000000,6.000000,2.000000,2.000000,3.000000,2.000000,0.000000,2.000000
50%,36.000000,802.000000,7.000000,3.000000,1.0,1020.500000,3.000000,66.000000,3.000000,2.000000,...,3.000000,80.0,1.000000,10.000000,3.000000,3.000000,5.000000,3.000000,1.000000,3.000000
75%,43.000000,1157.000000,14.000000,4.000000,1.0,1555.750000,4.000000,83.750000,3.000000,3.000000,...,4.000000,80.0,1.000000,15.000000,3.000000,3.000000,9.000000,7.000000,3.000000,7.000000
max,60.000000,1499.000000,29.000000,5.000000,1.0,2068.000000,4.000000,100.000000,4.000000,5.000000,...,4.000000,80.0,3.000000,40.000000,6.000000,4.000000,40.000000,18.000000,15.000000,17.000000

In [13]:
df.columns = (
    df.columns
    .str.strip()
    .str.lower()
    .str.replace(" ", "_")
)
df.columns

Index(['age', 'attrition', 'businesstravel', 'dailyrate', 'department',
       'distancefromhome', 'education', 'educationfield', 'employeecount',
       'employeenumber', 'environmentsatisfaction', 'gender', 'hourlyrate',
       'jobinvolvement', 'joblevel', 'jobrole', 'jobsatisfaction',
       'maritalstatus', 'monthlyincome', 'monthlyrate', 'numcompaniesworked',
       'over18', 'overtime', 'percentsalaryhike', 'performancerating',
       'relationshipsatisfaction', 'standardhours', 'stockoptionlevel',
       'totalworkingyears', 'trainingtimeslastyear', 'worklifebalance',
       'yearsatcompany', 'yearsincurrentrole', 'yearssincelastpromotion',
       'yearswithcurrmanager'],
      dtype='object')

In [17]:
df.columns.tolist()

['age',
 'attrition',
 'businesstravel',
 'dailyrate',
 'department',
 'distancefromhome',
 'education',
 'educationfield',
 'employeecount',
 'employeenumber',
 'environmentsatisfaction',
 'gender',
 'hourlyrate',
 'jobinvolvement',
 'joblevel',
 'jobrole',
 'jobsatisfaction',
 'maritalstatus',
 'monthlyincome',
 'monthlyrate',
 'numcompaniesworked',
 'over18',
 'overtime',
 'percentsalaryhike',
 'performancerating',
 'relationshipsatisfaction',
 'standardhours',
 'stockoptionlevel',
 'totalworkingyears',
 'trainingtimeslastyear',
 'worklifebalance',
 'yearsatcompany',
 'yearsincurrentrole',
 'yearssincelastpromotion',
 'yearswithcurrmanager']

In [18]:
df["employeenumber"].is_unique

True

In [19]:
conn = sqlite3.connect("hr.db")

df.to_sql(
    "employees",
    conn,
    if_exists="replace",
    index=False
)

conn.close()

In [20]:
df.shape[0]

1470

In [21]:
conn = sqlite3.connect("hr.db")

pd.read_sql(
    "SELECT COUNT(*) AS total_employees FROM employees",
    conn
)

   total_employees
0             1470

In [22]:
df["department"].value_counts()

department
Research & Development    961
Sales                     446
Human Resources            63
Name: count, dtype: int64

In [23]:
pd.read_sql("""
SELECT department, COUNT(*) AS employee_count
FROM employees
GROUP BY department
ORDER BY employee_count DESC
""", conn)

               department  employee_count
0  Research & Development             961
1                   Sales             446
2         Human Resources              63

In [26]:
df.groupby("jobrole")["monthlyincome"].mean().sort_values(ascending=False)

jobrole
Manager                      17181.676471
Research Director            16033.550000
Healthcare Representative     7528.763359
Manufacturing Director        7295.137931
Sales Executive               6924.279141
Human Resources               4235.750000
Research Scientist            3239.972603
Laboratory Technician         3237.169884
Sales Representative          2626.000000
Name: monthlyincome, dtype: float64

In [27]:
pd.read_sql("""
SELECT jobrole, ROUND(AVG(monthlyincome), 2) AS avg_monthly_income
FROM employees
GROUP BY jobrole
ORDER BY avg_monthly_income DESC
""", conn)

                     jobrole  avg_monthly_income
0                    Manager            17181.68
1          Research Director            16033.55
2  Healthcare Representative             7528.76
3     Manufacturing Director             7295.14
4            Sales Executive             6924.28
5            Human Resources             4235.75
6         Research Scientist             3239.97
7      Laboratory Technician             3237.17
8       Sales Representative             2626.00

In [28]:
df.sort_values(
    ["performancerating", "monthlyincome"],
    ascending=[False, False]
).head(5)[
    ["employeenumber", "jobrole", "department", "performancerating", "monthlyincome"]
]

,employeenumber,jobrole,department,performancerating,monthlyincome
746,1035,Research Director,Research & Development,4,19973
918,1282,Manager,Sales,4,19847
1009,1423,Research Director,Research & Development,4,19701
1129,1595,Manager,Research & Development,4,19613
1116,1578,Manager,Sales,4,19586

In [29]:
pd.read_sql("""
SELECT employeenumber,
       jobrole,
       department,
       performancerating,
       monthlyincome
FROM employees
ORDER BY performancerating DESC, monthlyincome DESC
LIMIT 5
""", conn)

,employeenumber,jobrole,department,performancerating,monthlyincome
0,1035,Research Director,Research & Development,4,19973
1,1282,Manager,Sales,4,19847
2,1423,Research Director,Research & Development,4,19701
3,1595,Manager,Research & Development,4,19613
4,1578,Manager,Sales,4,19586

In [30]:
df.groupby("department")["performancerating"].mean().sort_values(ascending=False)

department
Research & Development    3.162331
Human Resources           3.142857
Sales                     3.136771
Name: performancerating, dtype: float64

In [31]:
pd.read_sql("""
SELECT department,
       ROUND(AVG(performancerating), 3) AS avg_performance_rating
FROM employees
GROUP BY department
ORDER BY avg_performance_rating DESC
LIMIT 1
""", conn)

               department  avg_performance_rating
0  Research & Development                   3.162

In [32]:
df.groupby("department")["attrition"] \
  .apply(lambda x: (x == "Yes").mean()) \
  .sort_values(ascending=False)

department
Sales                     0.206278
Human Resources           0.190476
Research & Development    0.138398
Name: attrition, dtype: float64

In [33]:
pd.read_sql("""
SELECT department,
       AVG(CASE WHEN attrition = 'Yes' THEN 1 ELSE 0 END) AS attrition_rate
FROM employees
GROUP BY department
ORDER BY attrition_rate DESC
""", conn)

               department  attrition_rate
0                   Sales        0.206278
1         Human Resources        0.190476
2  Research & Development        0.138398

In [34]:
df.groupby("overtime")["attrition"] \
  .apply(lambda x: (x == "Yes").mean())

overtime
No     0.104364
Yes    0.305288
Name: attrition, dtype: float64

In [35]:
pd.read_sql("""
SELECT overtime,
       AVG(CASE WHEN attrition = 'Yes' THEN 1 ELSE 0 END) AS attrition_rate
FROM employees
GROUP BY overtime
""", conn)

  overtime  attrition_rate
0       No        0.104364
1      Yes        0.305288

In [36]:
df.groupby("education")["monthlyincome"] \
  .mean() \
  .sort_values(ascending=False)

education
5    8277.645833
4    6832.402010
3    6517.263986
2    6226.645390
1    5640.570588
Name: monthlyincome, dtype: float64

In [37]:
pd.read_sql("""
SELECT education,
       ROUND(AVG(monthlyincome), 2) AS avg_monthly_income
FROM employees
GROUP BY education
ORDER BY avg_monthly_income DESC
""", conn)

   education  avg_monthly_income
0          5             8277.65
1          4             6832.40
2          3             6517.26
3          2             6226.65
4          1             5640.57